Revit 2024 API
ParameterTypeId.ReferenceBaseOnHost Property
 "Reference Base on Host"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ReferenceBaseOnHost { get; }
Visual Basic
Public Shared ReadOnly Property ReferenceBaseOnHost As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ReferenceBaseOnHost {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace